In [1]:
import pandas as pd

df = pd.DataFrame(
    data=[
        ["Allen", 175, 22],
        ["Ted", 180, 25]
    ],
    columns=["Name", "Height", "Age"]
)

df_1 = pd.DataFrame(
    data=[
        ["Jake", 177, 28],
        ["Mary", 170, 24]
    ],
    columns=["Name", "Height", "Age"]
)

In [2]:
df.append(df_1)

C:\Users\Tibame_EX14\AppData\Local\Temp\ipykernel_13400\2998176055.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df_1)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
0   Jake     177   28
1   Mary     170   24

In [6]:
pd.concat([df, df_1]).reset_index()

   index   Name  Height  Age
0      0  Allen     175   22
1      1    Ted     180   25
2      0   Jake     177   28
3      1   Mary     170   24

In [7]:
pd.concat([df, df_1]).reset_index(drop=True)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
2   Jake     177   28
3   Mary     170   24

In [8]:
pd.concat([df, df_1], axis=1)

    Name  Height  Age  Name  Height  Age
0  Allen     175   22  Jake     177   28
1    Ted     180   25  Mary     170   24

In [10]:
df["Height"].apply(lambda x: (x * 2, x + 10))

0    (350, 185)
1    (360, 190)
Name: Height, dtype: object

In [11]:
df["Height"].apply(lambda x: (x * 2, x + 10)).to_list()

[(350, 185), (360, 190)]

In [12]:
pd.DataFrame(
    data=df["Height"].apply(lambda x: (x * 2, x + 10)).to_list()
)

     0    1
0  350  185
1  360  190

In [15]:
pd.concat(
    [
        df,
        pd.DataFrame(
            data=df["Height"].apply(lambda x: (x * 2, x + 10)).to_list()
        )
    ],
    axis=1
)

    Name  Height  Age    0    1
0  Allen     175   22  350  185
1    Ted     180   25  360  190

In [16]:
df["new"] = df["Height"].apply(lambda x: x * 2)
df

    Name  Height  Age  new
0  Allen     175   22  350
1    Ted     180   25  360

In [17]:
df["new2"] = df["Height"].apply(lambda x: x + 10)
df

    Name  Height  Age  new  new2
0  Allen     175   22  350   185
1    Ted     180   25  360   190